using System;

class Stek
{
    public static void Main()
    {
        int[,] sqrs = {
{1,0, 1, 1,1 , 1, 1, 1, 1, 1, 1, 1, 1, 1},
{1,0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1},
{1,0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1},
{1,0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1},
{1,0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0},
{1,1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0},
{1,1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0}
              };
        int i, j;
        for (i = 0; i < 7; i++)
        {
            for (j = 0; j < 14; j++)
                Console.Write(sqrs[i, j] + " ");
            Console.WriteLine();
        }


        Console.WriteLine("Координаты нулевых элементов матрицы чисел:");
        for (i = 0; i < 7; i++)
        {
            for (j = 0; j < 14; j++)
            {
                if (sqrs[i, j] == 0)
                {
                    Console.WriteLine("[" + i + ", " + j + "], ");
                }
            }
        }
    }
}
